In [1]:
import sqlite3
import pandas

In [19]:
pandas.set_option('display.max_rows', 500)

In [20]:
sqlite_file = 'lahman2014.sqlite'
conn = sqlite3.connect(sqlite_file)

## Part 1: Wrangling
### Problem 1

In [37]:
stats_query = "SELECT teamID, yearID, franchID, W, G, (W * 1.0) / (G * 1.0) * 100 as win_percentage FROM Teams"
team_stats = pandas.read_sql(stats_query, conn)
team_stats

     teamID  yearID franchID   W    G  win_percentage
0       BS1    1871      BNA  20   31       64.516129
1       CH1    1871      CNA  19   28       67.857143
2       CL1    1871      CFC  10   29       34.482759
3       FW1    1871      KEK   7   19       36.842105
4       NY2    1871      NNA  16   33       48.484848
...     ...     ...      ...  ..  ...             ...
2770    PIT    2014      PIT  88  162       54.320988
2771    SDN    2014      SDP  77  162       47.530864
2772    SFN    2014      SFG  88  162       54.320988
2773    SLN    2014      STL  90  162       55.555556
2774    WAS    2014      WSN  96  162       59.259259

[2775 rows x 6 columns]

In [42]:
salary_query = "SELECT yearID, teamID, salary  FROM Salaries"

team_salaries = pandas.read_sql(salary_query, conn)
team_salaries

       yearID teamID      salary
0        1985    ATL    870000.0
1        1985    ATL    550000.0
2        1985    ATL    545000.0
3        1985    ATL    633333.0
4        1985    ATL    625000.0
...       ...    ...         ...
24753    2014    WAS   3450000.0
24754    2014    WAS   3975000.0
24755    2014    WAS  20000000.0
24756    2014    WAS   7500000.0
24757    2014    WAS  14000000.0

[24758 rows x 3 columns]